Documents/NomenclaturePricing.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>NomenclaturePricing</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.NomenclaturePrices</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ResponsibleUser</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Products</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Nomenclature</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Nomenclature</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.NomenclatureCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Package</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.NomenclaturePackages</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PriceCategory</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.PriceCategories</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/PricingModes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>PricingModes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Manual</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FillByInfobaseData</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FillByOtherPriceCategories</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/NomenclaturePricing/Forms/CalculationSettingsForm/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	LoadOldPrices = Parameters.LoadOldPrices;
	LoadPriceCategories();
	SelectedOnly = 0;
	BlankOnly = 0;
	OldPriceDate = CurrentDate();
	
	PricingModesFillByInfobaseData = Enums.PricingModes.FillByInfobaseData;
	PricingModesFillByOtherPriceCategories = Enums.PricingModes.FillByOtherPriceCategories;
	
	Items.OK.Title = ?(LoadOldPrices, NStr("en = 'Fill'; ru = 'Загрузить'"), NStr("en = 'Calculate'; ru = 'Рассчитать'"));
	Items.PriceCategoriesRecalculate.Title = ?(LoadOldPrices, NStr("en = 'Fill'; ru = 'Загрузить'"), NStr("en = 'Recalculate'; ru = 'Пересчитать'"));
	Items.GroupParametersOldPriceRecalculation.Visible = LoadOldPrices;
	
EndProcedure



&AtServer
Procedure LoadPriceCategories()
	
	Query = New Query();
	Query.Text = "SELECT
	             |	PriceCategories.Ref,
	             |	PriceCategories.PricingMode
	             |FROM
	             |	Catalog.PriceCategories AS PriceCategories
	             |WHERE
	             |	PriceCategories.Ref IN(&ArrayPriceCategories)";
	Query.SetParameter("ArrayPriceCategories", Parameters.PriceCategories);
	TablePriceCategories = Query.Execute().Unload();
	
	// Load them manually in the form order	
	For each PriceCategory In Parameters.PriceCategories Do
		RowPriceCategory = PriceCategories.Add();
		RowPriceCategory.Reference = PriceCategory;
		RowPriceCategory.PricingMode = TablePriceCategories.Find(PriceCategory, "Ref").PricingMode;
		RowPriceCategory.Recalculate = True;
	EndDo;
	
EndProcedure


&AtClient
Procedure OK(Command)
	
	ArrayPriceCategories = New Array();            	
	For each PriceCategory In PriceCategories Do
		If PriceCategory.Recalculate Then
			ArrayPriceCategories.Add(PriceCategory.Reference);
		EndIf;
	EndDo;
	
	Result = New Structure();
	Result.Insert("LoadOldPrices", LoadOldPrices);
	Result.Insert("PriceCategories", ArrayPriceCategories);
	Result.Insert("SelectedOnly", SelectedOnly = 1);
	Result.Insert("BlankOnly", BlankOnly = 1);
	
	If LoadOldPrices Then
		Result.Insert("OldPriceDate", OldPriceDate);	
		Result.Insert("PricePercent", PricePercent);
	EndIf;		
	
	Close(Result);	

EndProcedure


&AtClient
Procedure PriceCategoriesSelectAll(Command)
	For each PriceCategory In PriceCategories Do
		PriceCategory.Recalculate = True;
	EndDo;
EndProcedure


&AtClient
Procedure PriceCategoriesDeselectAll(Command)
	For each PriceCategory In PriceCategories Do
		PriceCategory.Recalculate = False;
	EndDo;
EndProcedure
